## Reshape a pandas DataFrame using stack,unstack and melt method

Creating a new data frame

In [7]:
import pandas as pd
# create wide dataframe
df_wide = pd.DataFrame(
  {"student": ["Andy", "Bernie", "Cindy", "Deb"],
   "school":  ["Z", "Y", "Z", "Y"],
   "english": [10, 100, 1000, 10000],  # eng grades
   "math":    [20, 200, 2000, 20000],  # math grades
   "physics": [30, 300, 3000, 30000]   # physics grades
  }
)
print(df_wide)

  student school  english   math  physics
0    Andy      Z       10     20       30
1  Bernie      Y      100    200      300
2   Cindy      Z     1000   2000     3000
3     Deb      Y    10000  20000    30000

<b>Melt Example 1</b> <br>
We melt the dataframe by specifying the identifier columns via id_vars. The “leftover” non-identifier columns (english, math, physics) will be melted or stacked onto each other into one column.
A new indicator column will be created (contains values english, math, physics) and we can rename this new column (cLaSs) via var_name. We can also rename the column in which all the actual grades are contained (gRaDe) via value_name.

In [8]:
df_wide.melt(id_vars=["student", "school"],
             var_name="cLaSs",  # rename
             value_name="gRaDe")  # rename
#print(df_wide)

   student school    cLaSs  gRaDe
0     Andy      Z  english     10
1   Bernie      Y  english    100
2    Cindy      Z  english   1000
3      Deb      Y  english  10000
4     Andy      Z     math     20
5   Bernie      Y     math    200
6    Cindy      Z     math   2000
7      Deb      Y     math  20000
8     Andy      Z  physics     30
9   Bernie      Y  physics    300
10   Cindy      Z  physics   3000
11     Deb      Y  physics  30000

<b> Melt Example 2</b> <br>
You can use value_vars to specify which columns you want to melt or stack into column 
(here, we exclude physics column, so value_vars=["english", "math"]). We also drop the school 
column from id_vars.

In [9]:
df_wide.melt(id_vars="student", 
             value_vars=["english", "math"], 
             var_name="cLaSs",  # rename
             value_name="gRaDe")  # rename

  student    cLaSs  gRaDe
0    Andy  english     10
1  Bernie  english    100
2   Cindy  english   1000
3     Deb  english  10000
4    Andy     math     20
5  Bernie     math    200
6   Cindy     math   2000
7     Deb     math  20000

<b>Melt Example 3</b> <br>
Finally, let’s see what happens if we specify only the student column as the identifier column (id_vars="student") but do not specify which columns you want to stack via value_vars. As a result, all non-identifier columns (school, english, math, physics) will be stacked into one column.
The resulting long dataframe looks wrong because now the cLaSs and gRaDe columns contain values that shouldn’t be there. The point here is to show you how pd.melt works.

In [10]:
df_wide.melt(id_vars="student",
             var_name="cLaSs",  # rename
             value_name="gRaDe")  # rename

   student    cLaSs  gRaDe
0     Andy   school      Z
1   Bernie   school      Y
2    Cindy   school      Z
3      Deb   school      Y
4     Andy  english     10
5   Bernie  english    100
6    Cindy  english   1000
7      Deb  english  10000
8     Andy     math     20
9   Bernie     math    200
10   Cindy     math   2000
11     Deb     math  20000
12    Andy  physics     30
13  Bernie  physics    300
14   Cindy  physics   3000
15     Deb  physics  30000

In [2]:
# import pandas module
import pandas as pd

# making dataframe
df = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")

# it was print the first 5-rows
print(df.head())

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics     0.0       PG  25.0    6-2   180.0
1    Jae Crowder  Boston Celtics    99.0       SF  25.0    6-6   235.0
2   John Holland  Boston Celtics    30.0       SG  27.0    6-5   205.0
3    R.J. Hunter  Boston Celtics    28.0       SG  22.0    6-5   185.0
4  Jonas Jerebko  Boston Celtics     8.0       PF  29.0   6-10   231.0

             College     Salary
0              Texas  7730337.0
1          Marquette  6796117.0
2  Boston University        NaN
3      Georgia State  1148640.0
4                NaN  5000000.0

Using stack() method:

Stack method works with the MultiIndex objects in DataFrame, it returning a DataFrame with an index with a new inner-most level of row labels. It changes the wide table to a long table.

In [3]:
df_stacked = df.stack()

print(df_stacked.head(26))

0  Name            Avery Bradley
   Team           Boston Celtics
   Number                      0
   Position                   PG
   Age                        25
   Height                    6-2
   Weight                    180
   College                 Texas
   Salary            7.73034e+06
1  Name              Jae Crowder
   Team           Boston Celtics
   Number                     99
   Position                   SF
   Age                        25
   Height                    6-6
   Weight                    235
   College             Marquette
   Salary            6.79612e+06
2  Name             John Holland
   Team           Boston Celtics
   Number                     30
   Position                   SG
   Age                        27
   Height                    6-5
   Weight                    205
   College     Boston University
dtype: object

Using unstack() method:
unstack is similar to stack method, It also works with multi-index objects in dataframe, producing a reshaped DataFrame with a new inner-most level of column labels.

In [4]:
# unstack() method
df_unstacked = df_stacked.unstack()
print(df_unstacked.head(10))

            Name            Team Number Position Age Height Weight  \
0  Avery Bradley  Boston Celtics      0       PG  25    6-2    180
1    Jae Crowder  Boston Celtics     99       SF  25    6-6    235
2   John Holland  Boston Celtics     30       SG  27    6-5    205
3    R.J. Hunter  Boston Celtics     28       SG  22    6-5    185
4  Jonas Jerebko  Boston Celtics      8       PF  29   6-10    231
5   Amir Johnson  Boston Celtics     90       PF  29    6-9    240
6  Jordan Mickey  Boston Celtics     55       PF  21    6-8    235
7   Kelly Olynyk  Boston Celtics     41        C  25    7-0    238
8   Terry Rozier  Boston Celtics     12       PG  22    6-2    190
9   Marcus Smart  Boston Celtics     36       PG  22    6-4    220

             College       Salary
0              Texas  7.73034e+06
1          Marquette  6.79612e+06
2  Boston University          NaN
3      Georgia State  1.14864e+06
4                NaN        5e+06
5                NaN      1.2e+07
6                LSU  1.17096e+06
7            Gonzaga  2.16516e+06
8         Louisville  1.82436e+06
9     Oklahoma State  3.43104e+06

## Adding a derived attribute

To create a new column, use the [] brackets with the new column name at the left side of the assignment.

In [12]:
df_wide["average"] = (df_wide["english"]+df_wide["math"]+df_wide["physics"]) / 3
print(df_wide)

  student school  english   math  physics  average
0    Andy      Z       10     20       30     20.0
1  Bernie      Y      100    200      300    200.0
2   Cindy      Z     1000   2000     3000   2000.0
3     Deb      Y    10000  20000    30000  20000.0